{
    "details": [
        {
            "episode_id": "66927c5b75d133ab0d79c47e",
            "content": "Helen Stoner went to see Sherlock Holmes and Dr. Watson early one morning. She began to tell her testimony. She needed their help because her twin sister, Julia, had died mysteriously two years ago. Helen was very scared of her stepfather, Dr. Grimsby Roylott. He was strong and sometimes very frightening."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c47e",
            "content": "Helen told Holmes that Julia got engaged and then started hearing a low whistle at night. One night, Julia screamed loudly and ran to Helen's room. She collapsed on the floor and said the words 'stained string' before she died. This made Helen very sad and confused."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c47e",
            "content": "Now, Helen hears the same whistle at night in Julia's old room. She is very worried and hopes that Sherlock Holmes can solve this mystery."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c47f",
            "content": "Holmes and Watson went to Stoke Moran. They wanted to find out more about the Stoner family. The house was big but looked old and scary. Holmes and Watson felt something was wrong."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c47f",
            "content": "They talked to people in the village. They learned that Dr. Roylott was not a nice man. He did not have much money. This made him very angry and mean."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c47f",
            "content": "Holmes found out that Dr. Roylott wanted to keep Helen and Julia's money for himself. If they got married, he would lose the money. So, he tried to stop them from marrying. Holmes knew this was why Dr. Roylott acted so badly."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c480",
            "content": "Holmes and Watson went to Julia's room. Now, Helen lives there. They looked around carefully. The room seemed normal at first."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c480",
            "content": "Then, Holmes saw a vent on the wall. It was strange because it connected Helen's room to Dr. Roylott's room. Next, they found a bell pull. But it did not work. It was just hanging there for no reason."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c480",
            "content": "Finally, they noticed the bed. It was fixed to the floor and could not be moved. Holmes and Watson knew these things were important. They had to find out why they were there."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c481",
            "content": "Holmes and Watson were in Julia's room. It was very dark. They waited quietly for something to happen. Suddenly, they heard a low whistle. Holmes quickly hit the bell pull with his cane."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c481",
            "content": "After that, there was a loud metallic sound from Dr. Roylott's room. The noise was very strange. Holmes and Watson looked at each other, worried."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c481",
            "content": "Then, a snake came back to Dr. Roylott's room. It was very angry because of what Holmes did. The snake bit Dr. Roylott, and he died right away from the poison."
        },
        {
            "episode_id": "66927c5b75d133ab0d79c482",
            "content": "Back at 221B Baker Street, Holmes and Watson sat by the fire. Holmes told Watson that Dr. Roylott had trained a snake to kill Julia. He wanted to do the same with Helen. Dr. Roylott did this because he wanted all the money for himself. Holmes was very clever and stopped him just in time."
        }
    ]
}