{
  "episodes": [
    {
      "episode": 1,
      "title": "The Exciting Proposal",
      "description": "Detective Kogoro Mori is approached by Shogo Somei and Miako Kuzumi, who work for a small production company. They propose an exciting new TV show that follows detectives around the clock. With the help of famous singer Yoko Okino, they manage to get Mori's enthusiastic consent."
    },
    {
      "episode": 2,
      "title": "The Rainy Day Mystery",
      "description": "On a rainy day, Somei, Conan, Ran, and Kogoro arrive at producer Raisaku Nakame's apartment for a meeting. Somei arrives late and soaked from the rain despite driving. Inside, they find Raisaku dead with his coffee cup nearby. It looks like he might have poisoned himself.",
      "evidence_collected": [
        {
          "type": "Coffee cup and saucer",
          "description": "placed deliberately to mislead investigators.",
          "importance": 4
        }
      ]
    },
    {
      "episode": 3,
      "title": "Interviews and Discoveries",
      "description": "The police start their investigation and think it might be a murder made to look like suicide. Somei becomes a suspect because he has no alibi and seems to know too much about the scene. Conan interviews witnesses and finds that Somei was seen at a pharmacy during the time of the crime. This alibi seems to conflict with Somei's actions and statements.",
      "evidence_collected": [
        {
          "type": "Testimony from pharmacist", 
          "description": "placing Somei at the pharmacy at the time of crime.", 
          "importance": 3}
      ]
    },
    {
      "episode": 4,
      "title": "The Hidden Clue",
      "description": "Conan notices something strange during a closer examination. The fork and cake plate suggest someone else was there with Raisaku before he died. This makes it clear that it wasn't just a simple suicide.",
      "evidence_collected": [
        {
          "type": "Two coffee cups and plates",
          "description": "indicating two people were present.",
          "importance": 4
        },
        {
          "type": "Fork hidden in Somei's jacket",
          "description": "revealed by Conan as the missing piece of evidence.",
          "importance": 4
        }
      ]
    },
    {
      "episode": 5,
      "title": "The Final Reveal",
      "description": "Using his sharp detective skills, Conan reveals that Miako Kuzumi was the real culprit. She poisoned Raisaku to protect Somei from his threats and then took her own life. Somei tried to cover it up to protect her reputation."
    }
  ],
  "culprit_details": {
    "name": "Miako Kuzumi",
    "age": 29,
    "occupation": "Employee at Somei's company",
    "motive": "Protect Somei from Raisaku's coercion",
    "crimes": [
      "Murder of Raisaku Nakame"
    ]
  }
}