{
  "episodes": [
    {
      "episode": 1,
      "title": "Meeting with Detective Mori",
      "description": "Shogo Somei and Miako Kuzumi, representatives of a small outsourced production company, approach Detective Kogoro Mori about a special program that covers detectives 24 hours a day. They manage to get Mori's consent by involving Yoko Okino, a famous celebrity. The meeting seems straightforward, but Conan feels something is off."
    },
    {
      "episode": 2,
      "title": "Incident at Raisaku's Apartment",
      "description": "On a rainy day, Somei, Conan, Ran, and Kogoro arrive at producer Raisaku Nakame's apartment for a meeting. Somei is noticeably late and soaked from the rain despite driving. They find Raisaku dead from cyanide poisoning in his coffee, with the scene staged to suggest suicide.",
      "evidence_collected": [
        {
          "type": "Coffee cup and saucer",
          "description": "placed deliberately to mislead investigators.",
          "importance": 4
        }
      ]
    },
    {
      "episode": 3,
      "title": "Initial Investigation",
      "description": "The police begin their investigation, explaining that the scene's setup could imply a murder staged as suicide. They suspect Somei due to his lack of alibi and evidence manipulation."
    },
    {
      "episode": 4,
      "title": "Further Examination",
      "description": "During a closer examination, Conan notices that the placement of the fork and cake plate suggests the presence of another person. This complicates the initial theory of suicide.",
      "evidence_collected": [
        {
          "type": "Fork and cake plate",
          "description": "suggesting the presence of another person.",
          "importance": 2
        }
      ]
    },
    {
      "episode": 5,
      "title": "Crime Scene Analysis",
      "description": "Conan discovers additional coffee marks on the chair, indicating the criminal was present when the coffee was spilled. This points to an impossible crime since the apartment was locked from inside.",
      "evidence_collected": [
        {
          "type": "Coffee marks on chair legs",
          "description": "suggesting movement after coffee spilled.",
          "importance": 4
        }
      ]
    },
    {
      "episode": 6,
      "title": "Interviews and Discoveries",
      "description": "Conan interviews witnesses and finds that Somei was seen at a pharmacy during the time of the crime. This alibi seems to conflict with Somei's actions and statements.",
      "evidence_collected": [
        {
          "type": "Testimony from pharmacist",
          "description": "placing Somei at the pharmacy at the time of crime.",
          "importance": 3
        }
      ]
    },
    {
      "episode": 7,
      "title": "Revealing the True Sequence",
      "description": "Conan notices something strange during a closer examination. The fork and cake plate suggest someone else was there with Raisaku before he died. This makes it clear that it wasn't just a simple suicide.",
      "evidence_collected": [
        {
          "type": "Two coffee cups and plates",
          "description": "indicating two people were present.",
          "importance": 4
        },
        {
          "type": "Fork hidden in Somei's jacket",
          "description": "revealed by Conan as the missing piece of evidence.",
          "importance": 4
        }
      ]
    },
    {
      "episode": 8,
      "title": "The Culprit Revealed",
      "description": "Conan, using Kogoro's voice, reveals the true sequence of events. He uncovers that the real culprit was Miako Kuzumi, who poisoned Raisaku and then committed suicide by jumping from the balcony. Somei manipulated the evidence to protect her reputation."
    }
  ],
  "culprit_details": {
    "name": "Miako Kuzumi",
    "age": 29,
    "occupation": "Employee at Somei's company",
    "motive": "Protect Somei from Raisaku's coercion",
    "crimes": [
      "Murder of Raisaku Nakame"
    ]
  }
}
  