{
    "episodes": [
        {
            "episode": 1,
            "title": "Lost in the Forest",
            "description": "Hattori Heiji and Toyama Kazuha set out for the Takeda Mansion in Tottori Prefecture after receiving a mysterious invitation. As they navigate through the dense forest, they run out of fuel for their motorcycle and realize they've lost their phone. With no other options, they decide to continue on foot, hoping to find a landmark or someone who can guide them."
        },
        {
            "episode": 2,
            "title": "Unexpected Encounters",
            "description": "Heiji, Kazuha, and Robert Taylor, an American photographer they met in the forest, encounter Kogoro Mori, Edogawa Conan, and Ran Mori. They learn that everyone has been invited to the mansion under different pretexts. Deciding it's safer to stick together, they proceed towards the mansion as a group."
        },
        {
            "episode": 3,
            "title": "Dinner at the Mansion",
            "description": "After settling in at the mansion, the group gathers for dinner. The atmosphere is tense and ominous. During dinner, Robert expresses his desire to visit Misa's grave, a woman who cared for him three years ago. Ran and Kazuha accompany him to the grave site where Robert reveals his deep sorrow over Misa's death."
        },
        {
            "episode": 4,
            "title": "A Gruesome Discovery",
            "description": "The group finds Takeda Nobukazu's body hanging in the warehouse, staged to look like a spider's web. The discovery shocks everyone and deepens the mystery.",
            "evidence_collected": [
                {
                "type": "Blow to the back of the head",
                "description": "indicating an attack from behind.",
                "importance": 4
                },
                {
                "type": "Rusty nail",
                "description": "suggesting recent use of the otherwise unused building.",
                "importance": 3
                },
                {
                "type": "No exit except a small window",
                "description": "pointing to a locked-room scenario.",
                "importance": 5
                }
            ]
        },
        {
            "episode": 5,
            "title": "An Attack in the Shed",
            "description": "Kazuha is attacked with a stun gun while searching for her lost phone charm in the shed and loses consciousness. Later, Ran discovers that Kazuha has disappeared, heightening tension among the group.",
            "evidence_collected": [
                {
                "type": "BB pellet",
                "description": "indicating the presence of a BB gun.",
                "importance": 3
                },
                {
                "type": "Stun gun",
                "description": "used to knock out Kazuha, suggesting the assailant prepared for an attack.",
                "importance": 4
                }
            ]
        },
        {
            "episode": 6,
            "title": "Rescue Mission",
            "description": "Heiji rescues Kazuha, who is found tied up with fishing line in the warehouse. The noose around her neck was set up to make it appear as if she was about to be hanged.",
            "evidence_collected": [
                {
                "type": "Fishing line",
                "description": "used to tie up Kazuha.",
                "importance": 3
                },
                {
                "type": "Noose",
                "description": "a setup, indicating a staged scene.",
                "importance": 4
                }
            ]
        },
        {
            "episode": 7,
            "title": "Uncovering Secrets",
            "description": "Conan and Heiji discover that Nobukazu was involved in drug trafficking through his phone records. This new information provides a possible motive for his murder.",
            "evidence_collected": [
                {
                "type": "Nobukazu's phone records",
                "description": "showing involvement in drug trafficking.",
                "importance": 5
                }
            ]
        },
        {
            "episode": 8,
            "title": "The Culprit Revealed",
            "description": "Conan and Heiji identify Robert Taylor as the perpetrator. Driven by vengeance for Misa's death, Robert's statements reveal his deep-seated anger and desire for revenge.",
            "evidence_collected": [
                {
                "type": "Incriminating statements",
                "description": "made by Robert about Nobukazu's death.",
                "importance": 5
                }
            ]
        },
        {
            "episode": 9,
            "title": "The Truth Behind Misa's Death",
            "description": "The truth behind Misa's suicide is revealed. The twins misinterpreted Robert's message, leading to Misa's death. Family conflicts and Nobukazu's abuse played significant roles in her demise.",
            "evidence_collected": [
                {
                "type": "Twins' testimony",
                "description": "revealing the misinterpreted message.",
                "importance": 5
                },
                {
                "type": "Family records",
                "description": "confirming Ryuji as Misa's biological father.",
                "importance": 4
                }
            ]
        },
        {
            "episode": 10,
            "title": "Arrest and Confession",
            "description": "Robert Taylor is arrested after confessing his crimes. His meticulous planning involved using a marionette mechanism to create a seemingly impossible locked-room scenario for Nobukazu’s murder. His motive was clear—revenge for Misa’s tragic death due to Nobukazu’s abusive behavior."
        }
    ],
    "culprit_details": {
        "name": "Robert Taylor",
        "age": 26,
        "occupation": "Photographer",
        "motive": "Revenge for Misa's death",
        "crimes": [
        "Murder of Takeda Nobukazu",
        "Murder of Negishi Akio",
        "Attempted murder of Toyama Kazuha"
        ]
    }
}
