{
    "episodes": [
      {
        "episode": 1,
        "title": "Meeting with Detective Mori",
        "description": "Shogo Somei, the president of a small outsourced production company, and Miiko Kuzumi, an employee, approach Kogoro Mori to propose a special program that covers detectives 24 hours a day. Detective Mori agrees to participate due to the involvement of Yoko Okino. During the discussion, Ran notices the couple's watches that Shogo and Miiko are wearing, revealing their mutual affection."
      },
      {
        "episode": 2,
        "title": "Incident at Raisaku's Apartment",
        "description": "On the day of the meeting with producer Raisaku Nakame, Kogoro, Conan, and Ran arrive at Raisaku's apartment in heavy rain, waiting for Shogo and Miiko. Shogo arrives 30 minutes late, soaked despite having driven there. Unable to get a response from Raisaku, Shogo insists on entering the apartment, citing concern over Raisaku's recent involvement in a scandal. They break the chain lock and enter, discovering Raisaku's body.",
        "evidence_collected":[
            {
                "type": "Soaked",
                "description": "indicating recent outdoor activity despite driving.",
                "importance": 3
            }
        ]
      },
      {
        "episode": 3,
        "title": "Incident at Raisaku Nakame's Living Room",
        "description": "Raisaku Nakame is found dead from cyanide poisoning. The scene includes a spilled cup of coffee, a fork, a plate of cake, and signs of poisoning suicide. The police are unsure if it was suicide or murder. Conan finds that the coffee cup was intentionally placed on a support plate later, indicating evidence manipulation. Conan investigates further and discovers that the coffee marks on the chair legs were far apart, suggesting the chair was moved. This implies that the criminal was present at the crime scene when the coffee spilled, contradicting the idea of an impossible locked-room scenario.",
        "evidence_collected": [
          {
            "type": "Cyanide",
            "description": "indicating poisoning.",
            "importance": 3
          },
          {
            "type": "Support plate",
            "description": "under the cup, suggesting post-crime manipulation.",
            "importance": 4
          },
          {
            "type": "Coffee marks",
            "description": "indicating the chair was moved.",
            "importance": 4
          }
        ]
      },
      {
        "episode": 4,
        "title": "doubt about Shogo",
        "description": "Conan calls the company and pharmacy to confirm Shogo's alibi. It's revealed that Shogo was at a pharmacy at 6:30 PM, the estimated time of death. Conan also discovers that Shogo did not take leave on the day of the murder, meaning Shogo should not have been at Raisaku's house. Shogo did not inform the police about this alibi.",
        "evidence_collected": [
          {
            "type": "testimony",
            "description": "confirming Shogo's presence at the pharmacy during the estimated time of death.",
            "importance": 4
          }
        ]
      },
      {
        "episode": 5,
        "title": "deep observation of the scene",
        "description": "Conan uncovers the key trick. Shogo manipulated the scene to hide the presence of another person. Shogo combined the cakes on one plate and used the writing instrument as a pencil holder to disguise the additional cup as one used by Raisaku alone. Originally, there were two plates of cakes and two coffee cups.",
        "evidence_collected": [
          {
            "type": "writing instrument holder",
            "description": "smell of coffee.",
            "importance": 4
          },
          {
            "type": "fork",
            "description": "in Shogo's jacket, used to manipulate evidence.",
            "importance": 3
          },
          {
            "type": "Two plates and two coffee cups",
            "description": "indicating two people were present.",
            "importance": 4
          }
        ]
      },
      {
        "episode": 6,
        "title": "Revelation at Detective Agency",
        "description": "Miiko called Shogo to confess her love before committing suicide by jumping out of the window. Shogo hid her body in his car trunk to protect her reputation.",
        "evidence_collected":[
            {
                "type": "call record",
                "description": "Confession call record from Miiko to Shogo.",
                "importance": 3
            }
        ]
      },
      {
        "episode": 7,
        "title": "Arrest and Motive Explanation",
        "description": "With all evidence pointing towards Miiko Kuzumi as both victim and perpetrator, Conan explains how she visited Raisaku with poisoned cake and coffee. After serving them, she watched him consume it and then locked herself inside before jumping out of the window to commit suicide. Her motive was clear—she aimed to protect Shogo from Raisaku’s coercion and threats. With this revelation, Detective Mori ensures justice is served while reflecting on how love can drive people to extreme actions. The case concludes with everyone realizing how deep emotions can lead to drastic measures but also understanding that truth always finds its way out through meticulous investigation."
      }
    ],
    "culprit_details": {
      "name": "Miako Kuzumi",
      "age": 29,
      "occupation": "Employee at Somei's company",
      "motive": "Protect Somei from Raisaku's coercion",
      "crimes": [
        "Murder of Raisaku Nakame"
      ]
    }
  }
    