{
    "details": [
        {
            "episode_id": "6687e2172985e14d7b616665",
            "content": "Kogoro Mori, a renowned detective, was approached by Shogo Somei and Miiko Kuzumi with an intriguing proposal. They wanted to create a special program that would follow detectives around the clock, showcasing their work and lives. Kogoro was initially hesitant but changed his mind when he learned that Yoko Okino, a famous celebrity, would be involved in the project. Her presence made the idea more appealing to him."
        },
        {
            "episode_id": "6687e2172985e14d7b616665",
            "content": "During their discussion about the program, Ran, Kogoro's daughter, noticed something interesting. Both Shogo and Miiko were wearing identical watches. This small detail hinted at a close relationship between them, sparking Ran's curiosity. She wondered if there was more to their connection than just being colleagues."
        },
        {
            "episode_id": "6687e2982985e14d7b616666",
            "content": "On a rainy day, Kogoro, Conan, and Ran went to producer Raisaku Nakame's apartment for an important meeting. The rain was pouring heavily, making the streets slippery and visibility poor. Shogo arrived late, drenched despite having driven there, which seemed odd to everyone. They were all worried about Raisaku because he had been involved in a recent scandal that made headlines."
        },
        {
            "episode_id": "6687e2982985e14d7b616666",
            "content": "Their concern grew when Raisaku didn't answer the door. After knocking several times with no response, they decided to break into the apartment. Inside, they found Raisaku lying on the floor, lifeless. The room was eerily quiet except for the sound of rain hitting the windows. It was clear that something terrible had happened, and they knew they had to find out who was responsible for this tragic event."
        },
        {
            "episode_id": "6687e2bc2985e14d7b616667",
            "content": "Raisaku Nakame was found lifeless in his living room, with a spilled cup of coffee nearby. At first glance, it seemed like a tragic suicide. The authorities quickly concluded that Raisaku had poisoned himself with cyanide. However, Conan, the young detective, wasn't convinced by this simple explanation."
        },
        {
            "episode_id": "6687e2bc2985e14d7b616667",
            "content": "As Conan examined the scene more closely, he noticed something unusual about the coffee cup. It was placed on a support plate under the table, which seemed odd for someone committing suicide. This detail suggested that someone had tampered with the evidence after Raisaku's death. Conan knew this could not be ignored and decided to investigate further."
        },
        {
            "episode_id": "6687e2bc2985e14d7b616667",
            "content": "While looking around the room, Conan spotted coffee marks on the legs of a chair. These marks were far apart from each other, indicating that the chair had been moved recently. This clue was crucial because it showed that someone had rearranged the scene to make it look like a suicide. With these things, Conan began to piece together the truth behind Raisaku's mysterious death."
        },
        {
            "episode_id": "6687e2df2985e14d7b616668",
            "content": "Conan had a strong feeling that Shogo might be the culprit. He decided to dig deeper into Shogo's alibi. Conan called the local pharmacy where Shogo claimed he was during the time of the murder."
        },
        {
            "episode_id": "6687e2df2985e14d7b616668",
            "content": "The pharmacist confirmed that Shogo was indeed at the pharmacy at 6:30 PM, which was around the estimated time of death. This testimony made things more complicated. If Shogo was at the pharmacy, how could he have been at Raisaku's house committing the crime?"
        },
        {
            "episode_id": "6687e2df2985e14d7b616668",
            "content": "Moreover, it was discovered that Shogo did not take leave from work on the day of the murder. This meant he should have been at his workplace and not anywhere near Raisaku's house. Despite having such a strong alibi, Shogo never mentioned this to the police, raising further suspicions."
        },
        {
            "episode_id": "6687e2df2985e14d7b616668",
            "content": "Conan knew that there must be more to this story. Why would Shogo hide such an important piece of information? Was he trying to protect someone or was there another reason behind his silence? The mystery deepened as Conan continued his investigation, determined to uncover the truth."
        },
        {
            "episode_id": "6687e3092985e14d7b616669",
            "content": "Conan stood in the dimly lit room, carefully examining the scene. The crime seemed straightforward at first glance, but something felt off. He noticed a single plate with several cakes and one coffee cup on the table. Conan knew there had to be more to this setup."
        },
        {
            "episode_id": "6687e3092985e14d7b616669",
            "content": "After a thorough investigation, Conan discovered a crucial piece of evidence: a writing instrument holder that smelled faintly of coffee. This holder was cleverly used by Shogo to disguise an additional cup as if it belonged solely to Raisaku. It was clear that Shogo had gone to great lengths to manipulate the scene."
        },
        {
            "episode_id": "6687e3092985e14d7b616669",
            "content": "A fork tucked away in Shogo's jacket. This fork had been used to rearrange the cakes on one plate, making it appear as though only one person had been eating."
        },
        {
            "episode_id": "6687e3092985e14d7b616669",
            "content": "Additionally, Conan found two plates and two coffee cups, indicating that two people were present during the incident. With these pieces of evidence, Conan pieced together how Shogo had orchestrated the deception and uncovered the truth behind the crime."
        },
        {
            "episode_id": "6687e32e2985e14d7b61666a",
            "content": "Conan finally uncovered the truth. Miiko Kuzumi was the real culprit behind Raisaku's death. She had poisoned his coffee because Raisaku had been threatening Shogo, and she wanted to protect him."
        },
        {
            "episode_id": "6687e32e2985e14d7b61666a",
            "content": "After committing the crime, Miiko felt overwhelmed with guilt and decided to call Shogo. During this call, she confessed her love for him, knowing it might be her last chance."
        },
        {
            "episode_id": "6687e32e2985e14d7b61666a",
            "content": "Tragically, after the confession, Miiko jumped out of the window, ending her life. Shogo, devastated by her actions but wanting to preserve her dignity, hid her body in his car trunk. He hoped that by doing so, he could protect her reputation from being tarnished by the scandal."
        }
    ]
}